
from utils import *

def test_form():
    assert form() ==  ['2019.12.08', '2019.11.05', '2019.11.19', '2019.12.07', '2019.11.13']
def test_name():
    assert name() ==  ['Открытие вклада', 'Открытие вклада', 'Перевод организации', 'Перевод организации', 'Перевод со счета на счет']

def test_string():
    assert string() == ['Данные отсутствуют', 'Данные отсутствуют', 'Maestro 7810 84** **** 5568', 'VisaClassic 2842 87** **** 9012', 'Счет 3861 14** **** **** 9794']

def test_to():
    assert to() == ['Счет **5907', 'Счет **8381', 'Счет **2869', 'Счет **3655', 'Счет **8125']

def test_summ():
    assert summ() == ['41096.24 USD', '21344.35 руб.', '30153.72 руб.', '48150.39 USD', '62814.53 руб.']